{
  "topics": [
    {
      "title": "Real Madrid vs Red Bull Salzsburg 2025 live stream: Time, TV channels and how to watch FIFA Club World Cup online ",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "CWC MATCHDAY 3: 26 JUNE 2025",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Real Madrid vs Red Bull Salzsburg, 2025 FIFA Club World Cup: Predicted lineups",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Managing Madrid Podcast: Real Madrid vs Salzburg Preview, Club World Cup 2025",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Gonzalo García: “I hope I can be like Joselu”",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Brahim Díaz: “I’m at the best club in the world and I know there’s a lot of competition”",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Lucas Vázquez: “Now is not the time to talk about my future”",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Xabi Alonso to Managing Madrid: “I have some ideas for Fede Valverde”",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "RB Salzburgo - Real Madrid | ¡Sigue la previa del partido!",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Bombazo con el futuro de Konaté: quiere fichar gratis por el Real Madrid",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Salida inminente en el Real Madrid: será oficial en breve",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Fichaje en el Real Madrid: la perla de Alemania podría ser el tapado",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Xabi sorprende y habla sobre un posible fichaje: \"Me gustó mucho...\"",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Rodrygo, en el foco: las posibles alineaciones del Salzburgo - Real Madrid",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Mercado de fichajes | Bombazo Cristiano, novedades con Rodrygo...",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Prohibido fallar en Filadelfia: la previa del Salzburgo - Real Madrid",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "El Real Madrid sonríe con el bombazo en el arbitraje español: limpia total",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "La última hora sobre el futuro de Rodrygo: Real Madrid, City, Arsenal...",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Explota un jugador del Real Madrid: \"Para la mierda que hemos hecho este año...\"",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Bombazo del Real Madrid: cierra el fichaje de una estrella de la Juventus",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Guía para disfrutar una vuelta por Madrid: del nuevo Bernabéu al entretenimiento digital",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Xabi Alonso habla claro sobre la situación de Rodrygo en el Real Madrid",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Brahim Díaz: \"¿Rodrygo? Yo quiero ser titular. Xabi Alonso...\"",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Real Madrid fans passionately support their team, even when they travel to places like Charlotte",
      "date": "2025-06-26T15:18:11.546Z"
    },
    {
      "title": "Un jugador de LaLiga se acerca al Real Madrid: su renovación, paralizada",
      "date": "2025-06-26T15:37:33.521Z"
    },
    {
      "title": "Real Madrid vs. RB Salzburg prediction, odds: Free 2025 FIFA Club World Cup expert picks for Thursday, June 26 ",
      "date": "2025-06-26T16:07:54.439Z"
    },
    {
      "title": "Barça chief Laporta: Madrid have model of 'power'",
      "date": "2025-06-26T16:18:51.014Z"
    },
    {
      "title": "Real Madrid accuse FIFA of making a mistake after Xabi Alonso's men make long journey back to hotel after Club World Cup win ",
      "date": "2025-06-27T15:51:06.800Z"
    },
    {
      "title": "Nacho Peña reveals the real value that the Club World Cup has for Real Madrid",
      "date": "2025-06-27T15:53:21.337Z"
    },
    {
      "title": "Neither Tchouaméni nor Camavinga, the €24M signing takes charge: 'He's the best'",
      "date": "2025-06-27T16:06:19.140Z"
    },
    {
      "title": "Xabi Alonso lauds young Real Madrid striker after Club World Cup win",
      "date": "2025-06-27T16:15:13.918Z"
    },
    {
      "title": "Xabi Alonso confident he can get Vinicius Jr and Kylian Mbappe firing together as Real Madrid boss 'impressed' by Brazil star's defensive work  ",
      "date": "2025-06-27T16:18:38.391Z"
    },
    {
      "title": "Managing Madrid Podcast: Madrid Mornings | Xabi Alonso’s Real Madrid makes a statement (3-0)",
      "date": "2025-06-27T16:25:02.813Z"
    },
    {
      "title": "He was the weakest of Real Madrid against Salzburg, Xabi Alonso encouraged him: \"You haven't shone...\"",
      "date": "2025-06-27T16:27:36.978Z"
    },
    {
      "title": "Gonzalo is on fire, a starter at Real Madrid and massively increases his value",
      "date": "2025-06-27T16:34:03.996Z"
    },
    {
      "title": "Trent Alexander-Arnold makes telling admission after third game for Real Madrid",
      "date": "2025-06-27T16:36:16.523Z"
    },
    {
      "title": "‘Most Difficult Thing’—Trent Alexander-Arnold Reflects on Real Madrid Start, Club World Cup Chances",
      "date": "2025-06-27T16:51:51.795Z"
    },
    {
      "title": "Maldini bets on a farewell to Real Madrid after Gonzalo's breakthrough: 'He must leave'",
      "date": "2025-06-27T17:26:40.507Z"
    },
    {
      "title": "Pro Soccer Player Throws Chair, Hits Woman In Wild Pool Altercation, Caught On Video",
      "date": "2025-06-27T17:34:43.526Z"
    },
    {
      "title": "Former Connecticut girls soccer star Alexa Pino playing for Philippines Women's National Team",
      "date": "2025-06-27T17:37:15.524Z"
    },
    {
      "title": "Trent has told Bellingham in private: \"Real Madrid is not what I expected…\"",
      "date": "2025-06-28T13:12:34.961Z"
    },
    {
      "title": "Rodrygo sends three-word message amid Arsenal transfer links",
      "date": "2025-06-28T13:14:50.914Z"
    },
    {
      "title": "Another injury setback for Real Madrid! Xabi Alonso loses key figure ahead of Juventus clash with Los Blancos star ruled out for remainder of Club World Cup ",
      "date": "2025-06-28T13:19:35.606Z"
    },
    {
      "title": "Wizard Xabi Alonso, begins to transform Vinicius and now goes for Mbappé",
      "date": "2025-06-28T14:51:29.834Z"
    },
    {
      "title": "First David Alaba and now him, he’s been injured and will miss Real Madrid-Juventus.",
      "date": "2025-06-28T16:04:39.699Z"
    },
    {
      "title": "‘No Surprise’—Xabi Alonso Compares Real Madrid Breakout Star to Club Legend",
      "date": "2025-06-28T16:07:54.912Z"
    },
    {
      "title": "Real Madrid confirms the signing of the new Zidane: \"Same gestures\"",
      "date": "2025-06-29T10:39:13.981Z"
    },
    {
      "title": "The rise of Gonzalo Garcia, Real Madrid’s breakthrough star of the Club World Cup",
      "date": "2025-06-29T10:52:04.238Z"
    },
    {
      "title": "Real Madrid's Erling Haaland! Former coach tips FIFA Club World Cup breakout star Gonzalo Garcia to become home-grown ‘Galactico’ & team's striker 'for 10 or 12 years' ",
      "date": "2025-06-29T12:18:57.409Z"
    },
    {
      "title": "Alaba's meeting with Florentino after his serious injury, changes his future at Madrid",
      "date": "2025-06-29T18:14:13.942Z"
    },
    {
      "title": "Bellingham praises Xabi Alonso: \"He has a greay way of talking to the players\"",
      "date": "2025-06-30T00:57:19.303Z"
    },
    {
      "title": "FIFA announces the referee for Real Madrid - Juventus, warning to Atlético de Madrid included",
      "date": "2025-06-30T06:18:28.290Z"
    },
    {
      "title": "Nico Williams was open to joining Real Madrid instead of Barcelona as winger's flirtation with Clasico rivals sparked La Liga champions into action to sign Athletic Club star ",
      "date": "2025-06-30T12:21:30.070Z"
    },
    {
      "title": "Arsenal aim for left wing transfer: Is Real Madrid's Rodrygo the best fit to upgrade Gabriel Martinelli? ",
      "date": "2025-06-30T18:15:44.522Z"
    },
    {
      "title": "‘I took the Club World Cup as a challenge’: Dani Carvajal returns for Real Madrid",
      "date": "2025-07-01T01:00:17.128Z"
    },
    {
      "title": "Davide Ancelotti: \"The void left by Kroos was as great as the one left by Ramos and Cristiano\"",
      "date": "2025-07-01T06:17:17.183Z"
    },
    {
      "title": "Xabi Alonso Reveals Kylian Mbappe Fitness Status Amid Real Madrid ‘Challenges’",
      "date": "2025-07-01T12:21:58.507Z"
    },
    {
      "title": "‘Very Complicated’—Carlo Ancelotti’s Assistant Explains What Went Wrong at Real Madrid",
      "date": "2025-07-01T18:16:01.126Z"
    },
    {
      "title": "Real Madrid fans think it's time for a difficult conversation about one player despite Juventus win",
      "date": "2025-07-02T00:53:59.444Z"
    }
  ]
}
